import numpy as np

def f(x): return 5 * x**4

# Параметры
N = 80
Mx = 5 / 6  
Dx = 5 / 252
m = 0
g = 0

# Генерация случайных чисел и вычисление сумм
for i in range(N):
    r = np.random.uniform(0, 1) 
    x = r ** (1 / 5)  
    m += x
    g += x ** 2

# Вычисления
m = m / N  
g = g / N 
Dxn = g - m ** 2  

# Разница между оценками и точными значениями
Mxn = abs(Mx - m)
Dxq = abs(Dx - Dxn)

# Вывод результатов
print('')
print("┌───────┬──────────────────┬──────────────────┬──────────────────┬──────────────────┬──────────────────┬──────────────────┐")
print("│   N   │        Mx        │        m         │      |Mx-m|      │        Dx        │         g        │      |Dx-g|      │")
print("├───────┼──────────────────┼──────────────────┼──────────────────┼──────────────────┼──────────────────┼──────────────────┤")
print(f"│ {N:^5} │ {Mx:^16.3f} │ {m:^16.3f} │ {Mxn:^16.3f} │ {Dx:^16.3f} │ {Dxn:^16.3f} │ {Dxq:^16.3f} │")
print("└───────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┘")